In [ ]:
import pandas as pd
import numpy as np

In [ ]:
name = ['Siam','Jett','Phoenix']
marks = [19,20,15]
arr = np.array(marks)
d = {'Siam':19, 'Jett':20, 'Phoenix':15}

In [ ]:
pd.Series(data=marks,index=name)

Siam       19
Jett       20
Phoenix    15
dtype: int64

In [ ]:
pd.Series(marks,name) # we can also pass just the arr i.e np.array(marks)

Siam       19
Jett       20
Phoenix    15
dtype: int64

In [ ]:
pd.Series(d)

Siam       19
Jett       20
Phoenix    15
dtype: int64

In [ ]:
ser1 = pd.Series([1,2,3,4],['USA','Bangladesh','Pakistan','Japan'])
ser1

USA           1
Bangladesh    2
Pakistan      3
Japan         4
dtype: int64

In [ ]:
 ser1['Bangladesh']

2

In [ ]:
df = pd.DataFrame(np.random.randn(5,4),['USA','Bangladesh','India','Pakistan','Japan'],['std','mean','max','median'])
df

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074
Japan       0.166917 -0.507854 -0.684943  0.851396

In [ ]:
df['std']

USA          -1.248680
Bangladesh   -3.217984
India         0.524488
Pakistan     -2.096710
Japan         0.166917
Name: std, dtype: float64

In [ ]:
df[['std','mean']]

                 std      mean
USA        -1.248680  1.844364
Bangladesh -3.217984  1.490630
India       0.524488 -1.610689
Pakistan   -2.096710 -1.203963
Japan       0.166917 -0.507854

In [ ]:
df['new'] = df['std'] + df['mean']
df

                 std      mean       max    median       new
USA        -1.248680  1.844364 -1.318161  0.361696  0.595683
Bangladesh -3.217984  1.490630 -1.319257  0.429195 -1.727354
India       0.524488 -1.610689  0.307967  0.557299 -1.086201
Pakistan   -2.096710 -1.203963  0.054955  0.932074 -3.300674
Japan       0.166917 -0.507854 -0.684943  0.851396 -0.340937

In [ ]:
df.drop('new',axis=1)

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074
Japan       0.166917 -0.507854 -0.684943  0.851396

In [ ]:
df

                 std      mean       max    median       new
USA        -1.248680  1.844364 -1.318161  0.361696  0.595683
Bangladesh -3.217984  1.490630 -1.319257  0.429195 -1.727354
India       0.524488 -1.610689  0.307967  0.557299 -1.086201
Pakistan   -2.096710 -1.203963  0.054955  0.932074 -3.300674
Japan       0.166917 -0.507854 -0.684943  0.851396 -0.340937

In [ ]:
df.drop('new',axis=1, inplace=True)
df

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074
Japan       0.166917 -0.507854 -0.684943  0.851396

In [ ]:
df.drop('Japan',axis=0)

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074

In [ ]:
df

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074
Japan       0.166917 -0.507854 -0.684943  0.851396

In [ ]:
df.loc['USA']

std      -1.248680
mean      1.844364
max      -1.318161
median    0.361696
Name: USA, dtype: float64

In [ ]:
df.iloc[0]

std      -1.248680
mean      1.844364
max      -1.318161
median    0.361696
Name: USA, dtype: float64

In [ ]:
df.loc['USA','std']

-1.2486803962962176

In [ ]:
i = df.loc[['USA','Pakistan'],['std','mean']]
i

              std      mean
USA      -1.24868  1.844364
Pakistan -2.09671 -1.203963

In [ ]:
bool_df = i > 0
bool_df

            std   mean
USA       False   True
Pakistan  False  False

In [ ]:
df[bool_df]

            std      mean  max  median
USA         NaN  1.844364  NaN     NaN
Bangladesh  NaN       NaN  NaN     NaN
India       NaN       NaN  NaN     NaN
Pakistan    NaN       NaN  NaN     NaN
Japan       NaN       NaN  NaN     NaN

In [ ]:
df[df>0]

                 std      mean       max    median
USA              NaN  1.844364       NaN  0.361696
Bangladesh       NaN  1.490630       NaN  0.429195
India       0.524488       NaN  0.307967  0.557299
Pakistan         NaN       NaN  0.054955  0.932074
Japan       0.166917       NaN       NaN  0.851396

In [ ]:
df

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074
Japan       0.166917 -0.507854 -0.684943  0.851396

In [ ]:
df['std'] > 0 # returns a series

USA           False
Bangladesh    False
India          True
Pakistan      False
Japan          True
Name: std, dtype: bool

In [ ]:
df[df['std']>0] # checks columns where std is greater than 0

            std      mean       max    median
India  0.524488 -1.610689  0.307967  0.557299
Japan  0.166917 -0.507854 -0.684943  0.851396

In [ ]:
df

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074
Japan       0.166917 -0.507854 -0.684943  0.851396

In [ ]:
booldf = df['mean'] > 0
booldf

USA            True
Bangladesh     True
India         False
Pakistan      False
Japan         False
Name: mean, dtype: bool

In [ ]:
result = df[booldf]
result

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195

In [ ]:
col = ['max','median']
result[col]

                 max    median
USA        -1.318161  0.361696
Bangladesh -1.319257  0.429195

In [ ]:
df

                 std      mean       max    median
USA        -1.248680  1.844364 -1.318161  0.361696
Bangladesh -3.217984  1.490630 -1.319257  0.429195
India       0.524488 -1.610689  0.307967  0.557299
Pakistan   -2.096710 -1.203963  0.054955  0.932074
Japan       0.166917 -0.507854 -0.684943  0.851396

In [ ]:
df[(df['std']>0) & (df['mean']<0)]

            std      mean       max    median
India  0.524488 -1.610689  0.307967  0.557299
Japan  0.166917 -0.507854 -0.684943  0.851396

In [ ]:
outside = ['g1','g1','g2','g2','g2','g3']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index

[('g1', 1), ('g1', 2), ('g2', 3), ('g2', 1), ('g2', 2), ('g3', 3)]

In [ ]:
from pandas import random

ImportError: ignored

In [ ]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g2', 3),
            ('g2', 1),
            ('g2', 2),
            ('g3', 3)],
           )

In [ ]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['speed','velocity'])
df

         speed  velocity
g1 1 -0.396098  2.157816
   2  0.553734 -0.099634
g2 3 -0.389150  1.153053
   1  0.508410 -0.888985
   2  0.723619 -2.373327
g3 3  0.907391 -0.913801

In [ ]:
 df.loc['g1']

      speed  velocity
1 -0.396098  2.157816
2  0.553734 -0.099634

In [ ]:
 df.loc['g1'].loc[2]

speed       0.553734
velocity   -0.099634
Name: 2, dtype: float64

In [ ]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1) # drops any column which has null value

   C
0  1
1  2
2  3

In [ ]:
df.dropna(thresh=2) # drops a row which has 2 null value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
 df.fillna(value='Siam')

      A     B  C
0     1     5  1
1     2  Siam  2
2  Siam  Siam  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
data = {'Company':['Google','Instagram','FB','Google','Instagram','FB'],'Person':['Siam','Islam','Jett','Phoenix','Viper','KJ'],'Sales':[200,100,40,5000,625,2156]}

In [ ]:
df = pd.DataFrame(data)
df

     Company   Person  Sales
0     Google     Siam    200
1  Instagram    Islam    100
2         FB     Jett     40
3     Google  Phoenix   5000
4  Instagram    Viper    625
5         FB       KJ   2156

In [ ]:
df.groupby('Company').sum()

           Sales
Company
FB          2196
Google      5200
Instagram    725

In [ ]:
df.groupby('Company').sum().loc['FB']

Sales    2196
Name: FB, dtype: int64

In [ ]:
df.groupby('Company').count()

           Person  Sales
Company
FB              2      2
Google          2      2
Instagram       2      2

In [ ]:
df.groupby('Company').describe()

          Sales
          count    mean          std    min      25%     50%      75%     max
Company
FB          2.0  1098.0  1496.237949   40.0   569.00  1098.0  1627.00  2156.0
Google      2.0  2600.0  3394.112550  200.0  1400.00  2600.0  3800.00  5000.0
Instagram   2.0   362.5   371.231060  100.0   231.25   362.5   493.75   625.0

In [ ]:
df.groupby('Company').describe().transpose()

Company               FB      Google  Instagram
Sales count     2.000000     2.00000    2.00000
      mean   1098.000000  2600.00000  362.50000
      std    1496.237949  3394.11255  371.23106
      min      40.000000   200.00000  100.00000
      25%     569.000000  1400.00000  231.25000
      50%    1098.000000  2600.00000  362.50000
      75%    1627.000000  3800.00000  493.75000
      max    2156.000000  5000.00000  625.00000

In [ ]:
len(df['Company'].unique())

3

In [ ]:
df['Company'].nunique()

3

In [ ]:
df['Company'].value_counts()

FB           2
Google       2
Instagram    2
Name: Company, dtype: int64

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving Salaries.csv to Salaries.csv